IRP/src/ChartsOfCharacteristicTypes/CustomUserSettings/CustomUserSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
 <name>CustomUserSettings</name>
 <type>
  <types>CatalogRef.Companies</types>
  <types>Boolean</types>
  <types>String</types>
  <types>Date</types>
  <types>Number</types>
  <types>CatalogRef.Stores</types>
  <numberQualifiers>
   <precision>12</precision>
   <scale>3</scale>
  </numberQualifiers>
  <stringQualifiers>
   <length>100</length>
  </stringQualifiers>
 </type>
 <attributes>
  <name>IsCommon</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>RefersToObjects</name>
  <attributes>
   <name>FullName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Synonym</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/CommonModules/UserSettingsServerReuse/Module.bsl
Function GetPredefinedUserSettingNames() Export
	Result = New Structure();
	Result.Insert("USE_OBJECT_WITH_DELETION_MARK", "Use_object_with_deletion_mark");

	Return Result;
EndFunction

Function GetUserSettingsForClientModule(Ref) Export
	FilterParameters = New Structure();
	FilterParameters.Insert("MetadataObject", Ref.Metadata().FullName());
	Return GetUserSettings(SessionParameters.CurrentUser, FilterParameters, True);
EndFunction

Function GetUserSettings(User, FilterParameters, CallFromClient = False) Export
	Return UserSettingsServer._GetUserSettings(User, FilterParameters, CallFromClient);
EndFunction

Function CustomAttributeHaveRefToObject(AttributeName, MetadataObject) Export
	Query = New Query();
	Query.Text =
	"SELECT
	|	CustomUserSettingsRefersToObjects.Ref
	|FROM
	|	ChartOfCharacteristicTypes.CustomUserSettings.RefersToObjects AS CustomUserSettingsRefersToObjects
	|WHERE
	|	NOT CustomUserSettingsRefersToObjects.Ref.IsCommon
	|	AND CustomUserSettingsRefersToObjects.FullName = &MetadataFullName
	|	AND CustomUserSettingsRefersToObjects.Ref.UniqueID = &AttributeName";
	Query.SetParameter("AttributeName", AttributeName);
	Query.SetParameter("MetadataFullName", MetadataObject);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	If QuerySelection.Next() Then
		Return True;
	Else
		Return False;
	EndIf;
EndFunction
